/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3*/

/*Console.WriteLine ("Введите число №1: ");
int Num1 = Convert.ToInt32(Console.ReadLine());;
Console.WriteLine ("Введите число №2: ");
int Num2 = Convert.ToInt32(Console.ReadLine());
if (Num1 > Num2)
{
    Console.WriteLine(Num1);Console.WriteLine("большее");
    Console.WriteLine(Num2);Console.WriteLine("меньшее");
}
else
{
    Console.WriteLine(Num2);Console.WriteLine("большее");
    Console.WriteLine(Num1);Console.WriteLine("меньшее");
}*/

/*Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22*/

/*Console.WriteLine ("Введите число №1: ");
int Num1 = Convert.ToInt32(Console.ReadLine());;
Console.WriteLine ("Введите число №2: ");
int Num2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine ("Введите число №3: ");
int Num3 = Convert.ToInt32(Console.ReadLine());
int Max = Num1;
if (Num2 > Max)
 {
    Max = Num2;
 }
 if (Num3 > Max)
 {
    Max = Num3;
 }
 else
 {
    Max = Max;
 }
Console.WriteLine (Max);*/

/*Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет*/

/*Console.WriteLine ("Введите целое число");
int Num = Convert.ToInt32(Console.ReadLine());
if ((Num % 2) == 0)
{
    Console.WriteLine("четное");
}
else
{
    Console.WriteLine("нечетное");
}*/

/*Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8*/

/*Console.WriteLine ("Введите целое число");
int Num = Convert.ToInt32(Console.ReadLine());
int NumFirst = 2;
while(NumFirst <= Num)
{
    Console.Write(NumFirst);
    Console.Write(",");
    NumFirst = NumFirst + 2;
}*/